ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
                        <name>Secure</name>
                        <description>The channel 29 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel 29 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_30</name>
                    <description>Channel number</description>
                    <lsb>30</lsb>
                    <msb>30</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel 30 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel 30 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_31</name>
                    <description>Channel number</description>
                    <lsb>31</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel 31 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel 31 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <cluster>
                <name>LINK</name>
                <description>Unspecified</description>
                <headerStructName>UICR_DPPI_LOCAL_CH_LINK</headerStructName>
                <access>read-write</access>
                <addressOffset>0x004</addressOffset>
                <register>
                  <name>DIR</name>
                  <description>Description cluster: Request linking the channels of DPPI[n] in local domain as source or sink</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>CH_0</name>
                      <description>Link direction</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 0 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 0 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_1</name>
                      <description>Link direction</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 1 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 1 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_2</name>
                      <description>Link direction</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 2 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 2 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_3</name>
                      <description>Link direction</description>
                      <lsb>3</lsb>
                      <msb>3</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 3 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 3 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_4</name>
                      <description>Link direction</description>
                      <lsb>4</lsb>
                      <msb>4</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 4 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 4 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_5</name>
                      <description>Link direction</description>
                      <lsb>5</lsb>
                      <msb>5</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 5 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 5 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_6</name>
                      <description>Link direction</description>
                      <lsb>6</lsb>
                      <msb>6</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 6 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 6 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_7</name>
                      <description>Link direction</description>
                      <lsb>7</lsb>
                      <msb>7</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 7 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 7 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_8</name>
                      <description>Link direction</description>
                      <lsb>8</lsb>
                      <msb>8</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 8 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 8 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_9</name>
                      <description>Link direction</description>
                      <lsb>9</lsb>
                      <msb>9</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 9 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 9 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_10</name>
                      <description>Link direction</description>
                      <lsb>10</lsb>
                      <msb>10</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 10 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 10 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_11</name>
                      <description>Link direction</description>
                      <lsb>11</lsb>
                      <msb>11</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 11 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 11 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_12</name>
                      <description>Link direction</description>
                      <lsb>12</lsb>
                      <msb>12</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 12 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 12 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_13</name>
                      <description>Link direction</description>
                      <lsb>13</lsb>
                      <msb>13</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 13 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 13 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_14</name>
                      <description>Link direction</description>
                      <lsb>14</lsb>
                      <msb>14</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 14 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 14 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_15</name>
                      <description>Link direction</description>
                      <lsb>15</lsb>
                      <msb>15</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 15 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 15 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_16</name>
                      <description>Link direction</description>
                      <lsb>16</lsb>
                      <msb>16</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 16 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 16 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_17</name>
                      <description>Link direction</description>
                      <lsb>17</lsb>
                      <msb>17</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 17 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 17 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_18</name>
                      <description>Link direction</description>
                      <lsb>18</lsb>
                      <msb>18</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 18 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 18 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_19</name>
                      <description>Link direction</description>
                      <lsb>19</lsb>
                      <msb>19</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 19 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 19 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_20</name>
                      <description>Link direction</description>
                      <lsb>20</lsb>
                      <msb>20</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 20 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 20 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_21</name>
                      <description>Link direction</description>
                      <lsb>21</lsb>
                      <msb>21</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 21 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 21 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_22</name>
                      <description>Link direction</description>
                      <lsb>22</lsb>
                      <msb>22</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 22 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 22 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_23</name>
                      <description>Link direction</description>
                      <lsb>23</lsb>
                      <msb>23</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 23 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 23 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_24</name>
                      <description>Link direction</description>
                      <lsb>24</lsb>
                      <msb>24</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Source</name>
                          <description>The channel 24 is linked as source</description>
                          <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Sink</name>
                          <description>The channel 24 is linked as sink</description>
                          <value>0x0</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>CH_25</name>
                      <description>Link direction</description>
