ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
            <register>
              <name>RESPONSE0</name>
              <description>Unspecified</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VoltageLevel</name>
                  <description>Configure tamper policy for invalid voltage level on supply lines.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>Watchdog</name>
                  <description>Configure tamper policy for watchdog timer.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ExternalTamperSwitch</name>
                  <description>Configure tamper policy for external tamper switch.</description>
                  <lsb>8</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Manual</name>
                      <description>Block secure services until requested to unblock secure services. Allows user application to take required actions.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ExternalActiveShield</name>
                  <description>Configure tamper policy for external active shield. BICR is used to specify which channels (GPIOs) are enabled.</description>
                  <lsb>12</lsb>
                  <msb>15</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Manual</name>
                      <description>Block secure services until requested to unblock secure services. Allows user application to take required actions.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>InternalActiveShield</name>
                  <description>Configure tamper policy for internal active shield.</description>
                  <lsb>16</lsb>
                  <msb>19</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Manual</name>
                      <description>Block secure services until requested to unblock secure services. Allows user application to take required actions.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>InternalDetectors</name>
                  <description>Configure tamper policy for internal detectors including glitch detector, signal protector and CRACEN detector. See for more information. An automatic reset is issued upon detection.</description>
                  <lsb>20</lsb>
                  <msb>23</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>HardFault</name>
                  <description>Configure tamper policy for hard fault.</description>
                  <lsb>24</lsb>
                  <msb>27</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Manual</name>
                      <description>Block secure services until requested to unblock secure services. Allows user application to take required actions.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ApiFault</name>
                  <description>Configure tamper policy for invalid API usage.</description>
                  <lsb>28</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Manual</name>
                      <description>Block secure services until requested to unblock secure services. Allows user application to take required actions.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RESPONSE1</name>
              <description>Unspecified</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AdacFault</name>
                  <description>Configure tamper policy for invalid ADAC usage.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Manual</name>
                      <description>Block secure services until requested to unblock secure services. Allows user application to take required actions.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>StateFault</name>
                  <description>Configure tamper policy for illegal firmware execution state. Automatic reset is issued be secure domain before secure services are permitted again.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Manual</name>
                      <description>Block secure services until requested to unblock secure services. Allows user application to take required actions.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TemperatureFault</name>
                  <description>Configure out-of-range on-die temperature tamper policy. A reset is required to continue providing secure services once the on-temperature is within valid operating conditions again. This reset is automatically triggered by the secure domain.</description>
                  <lsb>8</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Manual</name>
                      <description>Block secure services until requested to unblock secure services. Allows user application to take required actions.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PowerCycle</name>
                      <description>Block secure services until power cycling the device.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>Block secure services until device has been powered and idle for 15 minutes.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>Block secure services until device has been powered and idle for one hour.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LCSDiscarded</name>
                      <description>Transition to LCS Discarded. Warning, this bricks the device permanently.</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ResetOnly</name>
                      <description>No addition penalty besides the automatic reset.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
