ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
          <register>
            <name>DRIVECTRL1</name>
            <description>Drive control configuration for P8 to P15 IO ports.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>P8</name>
                <description>P8 drive control configuration.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Port supply is unconfigured. PORTCNF.DRIVECTRL will not be adjusted.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms33</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 33 Ohms.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms40</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 40 Ohms.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms50</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 50 Ohms.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms66</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 66 Ohms.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms100</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 100 Ohms.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BIASCTRL0</name>
            <description>Bias control configuration for P0 to P7 IO ports.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>P5</name>
                <description>P5 bias control configuration.</description>
                <lsb>20</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Port supply is unconfigured. PORTCNF.BIASCTRL will not be adjusted.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Freq24</name>
                    <description>PORTCNF.BIASCTRL will be adjusted for frequency range 8MHz to 24MHz.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Freq48</name>
                    <description>PORTCNF.BIASCTRL will be adjusted for frequency range 24MHz to 48MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Freq72</name>
                    <description>PORTCNF.BIASCTRL will be adjusted for frequency range 48MHz to 72MHz.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Freq100</name>
                    <description>PORTCNF.BIASCTRL will be adjusted for frequency range 72MHz to 100MHz.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>LFOSC</name>
          <description>Unspecified</description>
          <headerStructName>BICR_LFOSC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x018</addressOffset>
          <register>
            <name>LFXOCONFIG</name>
            <description>LFXO configuration.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACCURACY</name>
                <description>LFXO crystal or external signal accuracy.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The accuracy is unconfigured.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>500ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 500 ppm.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>250ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 250 ppm.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>150ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 150 ppm.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 100 ppm.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>75ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 75 ppm.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>50ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 50 ppm.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>30ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 30 ppm.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>20ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 20 ppm.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>LFXO mode. LFXO will not start unless MODE is configured. Setting this field to anyting but Unconfigured will be used as the indication that the selected source is available as input to the LFXO.</description>
                <lsb>4</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The mode is unconfigured.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Crystal</name>
                    <description>LFXO in external crystal oscillator mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ExtSine</name>
                    <description>LFXO in external sine wave mode.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ExtSquare</name>
                    <description>LFXO in external square wave mode.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>LFXO is not to be used.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOADCAP</name>
                <description>Built-in load capacitors selection in 1 pF steps. Max. value 25 pF.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The built-in load capacitors is unconfigured. LFXO will not start unless LOADCAP is configured.</description>
                    <value>0xFF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Do not use the built-in load capacitors, only external capacitors will be used.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIME</name>
                <description>LFXO startup time in ms.</description>
                <lsb>16</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Startup time has not been configured.</description>
                    <value>0xFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LFXOCAL</name>
            <description>LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board circuit, load capacitance, or crystal swap.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LFXOCAL</name>
                <description>LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board circuit, load capacitance, or crystal swap.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Calibrate</name>
                    <description>Calibrate the LFXO at startup.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LFRCAUTOCALCONFIG</name>
            <description>LFRC autocalibration configuration.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TEMPINTERVAL</name>
                <description>Temperature measurement interval in 0.25 s steps.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>TEMPDELTA</name>
                <description>Temperature delta that should trigger a calibration in 0.25 degrees steps.</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>INTERVALMAXNO</name>
                <description>Maximum number of TEMPINTERVAL periods in between calibrations, independent of temperature changes.</description>
                <lsb>16</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>ENABLE</name>
                <description>LFRC.AUTOCALCONFIG register enable.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>LFRC.AUTOCALCONFIG register has been configured and can be used.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>LFRC.AUTOCALCONFIG register has not been configured and cannot be used.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>HFXO64M</name>
          <description>Unspecified</description>
          <headerStructName>BICR_HFXO64M</headerStructName>
          <access>read-write</access>
          <addressOffset>0x02C</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>HFXO64M configuration.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE</name>
                <description>HFXO64M mode.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The mode is unconfigured.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Normal</name>
                    <description>Normal operating mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCXO</name>
                    <description>TCXO/bypass mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Crystal2</name>
                    <description>Reserved value</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Crystal3</name>
                    <description>Reserved value</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Crystal4</name>
                    <description>Reserved value</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Crystal5</name>
                    <description>Reserved value</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Crystal6</name>
                    <description>Reserved value</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTUPTIME</name>
            <description>HFXO64M startup time in us.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIME</name>
                <description>HFXO64M startup time in us.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Startup time has not been configured.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TAMPC</name>
          <description>Unspecified</description>
          <headerStructName>BICR_TAMPC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x034</addressOffset>
          <register>
            <name>TAMPERSWITCH</name>
            <description>Configuration for external tamper switch detector.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TAMPERSWITCH</name>
                <description>Tamper switch enable.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Tamper switch is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Tamper switch is enabled. Any value but 0xF is to be considered Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ACTIVESHIELD</name>
            <description>Configuration for active shield channels.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHEN_0</name>
                <description>Active shield enable for channel 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 0 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 0 is enabled. Any value but 0xF is to be considered Enabled. If any channel is Enabled, the feature should be Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHEN_1</name>
                <description>Active shield enable for channel 1.</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 1 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 1 is enabled. Any value but 0xF is to be considered Enabled. If any channel is Enabled, the feature should be Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHEN_2</name>
                <description>Active shield enable for channel 2.</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 2 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 2 is enabled. Any value but 0xF is to be considered Enabled. If any channel is Enabled, the feature should be Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHEN_3</name>
                <description>Active shield enable for channel 3.</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 3 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 3 is enabled. Any value but 0xF is to be considered Enabled. If any channel is Enabled, the feature should be Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>MISPROT</name>
          <description>Unspecified</description>
          <headerStructName>BICR_MISPROT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x03C</addressOffset>
          <register>
            <name>POWERCONFIG</name>
            <description>Misconfiguration report for POWER.CONFIG register.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POWERCONFIG</name>
                <description>Misconfiguration report configuration for POWER.CONFIG register.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Correct</name>
                    <description>POWER.CONFIG register does not have an invalid field.</description>
                    <value>0x471B4B2A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Incorrect</name>
                    <description>POWER.CONFIG register has at least an invalid field. POWER.CONFIG register is not used and should be corrected.</description>
                    <value>0xAA95E6D8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
