ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
          <register>
            <name>IOPORTPOWER</name>
            <description>Misconfiguration report for IOPORT.POWER0 and IOPORT.POWER1 registers.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IOPORTPOWER</name>
                <description>Misconfiguration report configuration for IOPORT.POWER0 and IOPORT.POWER1 registers.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Correct</name>
                    <description>IOPORT.POWER0 and IOPORT.POWER1 registers do not have an invalid field.</description>
                    <value>0x471B4B2A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Incorrect</name>
                    <description>IOPORT.POWER0 and/or IOPORT.POWER1 registers have at least an invalid field. Invalid field is not used and should be corrected.</description>
                    <value>0xAA95E6D8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IOPORTDRIVECTRL</name>
            <description>Misconfiguration report for IOPORT.DRIVECTRL0 and IOPORT.DRIVECTRL1 registers.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IOPORTDRIVECTRL0</name>
                <description>Misconfiguration report for IOPORT.DRIVECTRL0 and IOPORT.DRIVECTRL1 registers.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Correct</name>
                    <description>IOPORT.DRIVECTRL0 and IOPORT.DRIVECTRL1 register does not have an invalid field.</description>
                    <value>0x471B4B2A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Incorrect</name>
                    <description>IOPORT.DRIVECTRL0 and/or and IOPORT.DRIVECTRL1 registers have at least an invalid field. Invalid field is not used and should be corrected.</description>
                    <value>0xAA95E6D8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>WIFIRADIO</name>
          <description>Unspecified</description>
          <headerStructName>BICR_WIFIRADIO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x048</addressOffset>
          <register>
            <name>BACKOFF1</name>
            <description>Band edge channel transmit power backoff (in dB) for regulatory bands</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BAND2GLOWER</name>
                <description>TX power backoff (in dB) for the lower edge of 2.4GHz frequency band</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>BAND2GUPPER</name>
                <description>TX power backoff (in dB) for the upper edge of 2.4GHz frequency band</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>BANDUNII1LOWER</name>
                <description>TX power backoff (in dB) for the lower edge of UNII-1 frequency band</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>BANDUNII1UPPER</name>
                <description>TX power backoff (in dB) for the upper edge of UNII-1 frequency band</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BANDUNII2ALOWER</name>
                <description>TX power backoff (in dB) for the lower edge of UNII-2A frequency band</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>BANDUNII2AUPPER</name>
                <description>TX power backoff (in dB) for the upper edge of UNII-2A frequency band</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>BANDUNII2CLOWER</name>
                <description>TX power backoff (in dB) for the lower edge of UNII-2C frequency band</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>BANDUNII2CUPPER</name>
                <description>TX power backoff (in dB) for the upper edge of UNII-2C frequency band</description>
                <lsb>28</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BACKOFF2</name>
            <description>Band edge channel transmit power backoff (in dB) for regulatory bands</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BANDUNII3LOWER</name>
                <description>TX power backoff (in dB) for the lower edge of UNII-3 frequency band</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>BANDUNII3UPPER</name>
                <description>TX power backoff (in dB) for the upper edge of UNII-3 frequency band</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>BANDUNII4LOWER</name>
                <description>TX power backoff (in dB) for the lower edge of UNII-4 frequency band</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>BANDUNII4UPPER</name>
                <description>TX power backoff (in dB) for the upper edge of UNII-4 frequency band</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ANTGAIN</name>
            <description>Antenna gain (in dB) used to adjust TX power</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GAIN2G</name>
                <description>Antenna gain (in dB) for the 2.4GHz frequency band</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>GAIN5GBAND1</name>
                <description>Antenna gain (in dB) for the 5GHz frequency band 1</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GAIN5GBAND2</name>
                <description>Antenna gain (in dB) for the 5GHz frequency band 2</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>GAIN5GBAND3</name>
                <description>Antenna gain (in dB) for the 5GHz frequency band 3</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x10</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>RFTRIMSPARE[%s]</name>
            <description>Description collection: Arbitrary RF register trim</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Trim value to apply</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ADDRESS</name>
                <description>Register address to apply trim value to. Address 0x3FFF indicates unused trim value.</description>
                <lsb>8</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
        </cluster>
