ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
                <register>
                  <name>MBIASIBPSR</name>
                  <description>Trim value for SYSCTRL.MBIAS.TRIM.MBIASIBPSR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>OSCRFR</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_OSCRFR</headerStructName>
              <access>read-write</access>
              <addressOffset>0x8C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_OSCRFR_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>OSC</name>
                  <description>Trim value for SYSCTRL.OSCRFR.TRIM.OSC</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>IBPSR</name>
                  <description>Trim value for SYSCTRL.OSCRFR.TRIM.IBPSR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREG1V0</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREG1V0</headerStructName>
              <access>read-write</access>
              <addressOffset>0x94</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREG1V0_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>IREF</name>
                  <description>Trim value for SYSCTRL.VREG1V0.TRIM.IREF</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HIGHPOWER</name>
                  <description>Trim value for SYSCTRL.VREG1V0.TRIM.HIGHPOWER</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWER</name>
                  <description>Trim value for SYSCTRL.VREG1V0.TRIM.LOWPOWER</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ULPR</name>
                  <description>Trim value for SYSCTRL.VREG1V0.TRIM.ULPR</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>VOUTHPNOMINAL</name>
                <description>Config value for SYSCTRL.VREG1V0.VOUTHPNOMINAL</description>
                <addressOffset>0x10</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Config value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>VREGAO0V8</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGAO0V8</headerStructName>
              <access>read-write</access>
              <addressOffset>0xA8</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>IREF</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.TRIM.IREF</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HIGHPOWER</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.TRIM.HIGHPOWER</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWER</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.TRIM.LOWPOWER</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ULTRALOWPOWER</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.TRIM.ULTRALOWPOWER</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BPDET</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.TRIM.BPDET</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREGAO1V8</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGAO1V8</headerStructName>
              <access>read-write</access>
              <addressOffset>0xBC</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>IREF</name>
                  <description>Trim value for SYSCTRL.VREGAO1V8.TRIM.IREF</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VREF</name>
                  <description>Trim value for SYSCTRL.VREGAO1V8.TRIM.VREF</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWER</name>
                  <description>Trim value for SYSCTRL.VREGAO1V8.TRIM.LOWPOWER</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWERDIFF</name>
                  <description>Trim value for SYSCTRL.VREGAO1V8.TRIM.LOWPOWERDIFF</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREGMAIN</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGMAIN</headerStructName>
              <access>read-write</access>
              <addressOffset>0xCC</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGMAIN_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>BIASIBPP</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.BIASIBPP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BIASIBPSR</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.BIASIBPSR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDDAO1V8HYSTOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.VDDAO1V8HYSTOUTPUT</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDDAO1V8PWMOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.VDDAO1V8PWMOUTPUT</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDD1V0HYSTOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.VDD1V0HYSTOUTPUT</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDDVS0V8HYSTOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.VDDVS0V8HYSTOUTPUT</description>
                  <addressOffset>0x14</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDDVS0V8PWMOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.VDDVS0V8PWMOUTPUT</description>
                  <addressOffset>0x18</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDD1V0PWMOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.VDD1V0PWMOUTPUT</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ZCROSS</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.ZCROSS</description>
                  <addressOffset>0x20</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HSILIM</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.HSILIM</description>
                  <addressOffset>0x24</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ICMP</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.ICMP</description>
                  <addressOffset>0x28</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VGND</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.VGND</description>
                  <addressOffset>0x2C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>CONFIG</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG</headerStructName>
                <access>read-write</access>
                <addressOffset>0x30</addressOffset>
                <register>
                  <name>CFGCH1</name>
                  <description>Config value for SYSCTRL.VREGMAIN.CONFIG.CFGCH1</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Config value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>MODE</name>
                <description>Config value for SYSCTRL.VREGMAIN.MODE</description>
                <addressOffset>0x34</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Config value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
