ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
          <register>
            <name>DATABUFFERTHLDCTRL</name>
            <description>Data Buffer Threshold Control Register</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x01010101</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXEMPTYBUFTHLD</name>
                <description>Transmit Buffer Threshold Value</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>THRESHOLD1</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD14</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD18</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD116</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD132</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD164</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXBUFTHLD</name>
                <description>Receive Buffer Threshold Value</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>THRESHOLD1</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD4</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD8</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD16</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD32</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD64</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSTARTTHLD</name>
                <description>Transfer Start Threshold Value</description>
                <lsb>16</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>THRESHOLD1</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD4</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD8</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD16</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD32</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD64</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXSTARTTHLD</name>
                <description>Receive Start Threshold Value</description>
                <lsb>24</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>THRESHOLD1</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD4</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD8</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD16</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD32</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THRESHOLD64</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IBIQUEUECTRL</name>
            <description>This Register is used to control whether or not to intimate the application if an IBI request is rejected (Nacked).</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NOTIFYHJREJECTED</name>
                <description>Notify Rejected Hot-Join Control.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTIFYMRREJECTED</name>
                <description>Notify Rejected Master Request Control.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Suppress passing the IBI Status to the IBI FIFO (hence not notifying the application) when a MR Request is NACKed and auto-disabled based on the IBI_MR_REQ_REJECT Register.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Writes IBI Status to the IBI FIFO (hence notifying the application) when a MR Request is NACKed and auto-disabled based on the IBI_MR_REQ_REJECT Register.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NOTIFYSIRREJECTED</name>
                <description>Notify Rejected Slave Interrupt Request Control.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Suppress passing the IBI Status to the IBI FIFO (hence not notifying the application) when a Slave Interrupt Request is NACKed and auto-disabled based on the IBI_SIR_REQ_REJECT Register.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Writes IBI Status to the IBI FIFO (hence notifying the application) when a Slave Interrupt Request is NACKed and auto-disabled based on the IBI_SIR_REQ_REJECT Register.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IBIMRREQREJECT</name>
            <description>IBI Master Request Rejection Control Register.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MRREQREJECT</name>
                <description>In-band Master Request Reject.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ACK</name>
                    <description>ACK Master Request.</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NACK</name>
                    <description>NACK and send Directed DISEC CCC to disable the interrupting slave.</description>
                    <value>0x00000001</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IBISIRREQREJECT</name>
            <description>IBI SIR Request Rejection Control</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIRREQREJECT</name>
                <description>In-band Slave Interrupt Request Reject</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ACK</name>
                    <description>ACK the SIR Request.</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NACK</name>
                    <description>NACK and send directed auto disable CCC.</description>
                    <value>0x00000001</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RESETCTRL</name>
            <description>This Register is used for general software reset and for individual buffer reset.</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SOFTRST</name>
                <description>Core Software Reset.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>CMDQUEUERST</name>
                <description>Command Queue Software Reset</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>RESPQUEUERST</name>
                <description>Response Queue Software Reset</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>TXFIFORST</name>
                <description>Transmit Buffer Software Reset</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RXFIFORST</name>
                <description>Receive Buffer Software Reset.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>IBIQUEUERST</name>
                <description>IBI Queue Software Reset.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>BUSRESETTYPE</name>
                <description>Bus Reset type</description>
                <lsb>29</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EXIT</name>
                    <description>Exit Pattern.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SCL_LOW_RESET</name>
                    <description>SCL_LOW_RESET Pattern.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BUSRESET</name>
                <description>Bus Reset.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SLVEVENTSTATUS</name>
            <description>This register indicates the status/values of some events/controls that are relavant to slave mode of operation.</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000B</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIREN</name>
                <description>Slave Interrupt Request Enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MREN</name>
                <description>Master Request Enable.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>HJEN</name>
                <description>Hot-Join Interrupt Enable</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ACTIVITYSTATE</name>
                <description>Activity State Status.</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ENTAS0</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENTAS1</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENTAS2</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENTAS3</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MRLUPDATED</name>
                <description>MRL Updated Status.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>MWLUPDATED</name>
                <description>MWL Updated Status.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTRSTATUS</name>
            <description>Interrupt Status Register</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXTHLDSTS</name>
                <description>Transmit Buffer Threshold Status</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RXTHLDSTS</name>
                <description>Receive Buffer Threshold Status.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IBITHLDSTS</name>
                <description>IBI Buffer Threshold Status.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CMDQUEUEREADYSTS</name>
                <description>Command Queue Ready.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RESPREADYSTS</name>
                <description>Response Queue Ready Status.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TRANSFERABORTSTS</name>
                <description>Transfer Abort Status.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CCCUPDATEDSTS</name>
                <description>CCC Table Updated Status.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DYNADDRASSGNSTS</name>
                <description>Dynamic Address Assigned Status.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TRANSFERERRSTS</name>
                <description>Transfer Error Status.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DEFSLVSTS</name>
                <description>Define Slave CCC Received Status.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>READREQRECVSTS</name>
                <description>Read Request Received.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IBIUPDATEDSTS</name>
                <description>IBI status is updated.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>BUSOWNERUPDATEDSTS</name>
                <description>This interrupt is set when the role of the controller changes from being a Master to Slave or vice versa.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>BUSRESETDONESTS</name>
                <description>Bus Reset Pattern Generation Done Status.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
