ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
        <register>
          <name>IR</name>
          <description>Interrupt Register</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RF0N</name>
              <description>Rx FIFO 0 New Message</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No new message written to Rx FIFO 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>New message written to Rx FIFO 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF0W</name>
              <description>Rx FIFO 0 Watermark Reached</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Rx FIFO 0 fill level below watermark</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Rx FIFO 0 fill level reached watermark</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF0F</name>
              <description>Rx FIFO 0 Full</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Rx FIFO 0 not full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Rx FIFO 0 full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF0L</name>
              <description>Rx FIFO 0 Message Lost</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No Rx FIFO 0 message lost</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF1N</name>
              <description>Rx FIFO 1 New Message</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No new message written to Rx FIFO 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>New message written to Rx FIFO 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF1W</name>
              <description>Rx FIFO 1 Watermark Reached</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Rx FIFO 1 fill level below watermark</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Rx FIFO 1 fill level reached watermark</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF1F</name>
              <description>Rx FIFO 1 Full</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Rx FIFO 1 not full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Rx FIFO 1 full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF1L</name>
              <description>Rx FIFO 1 Message Lost</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No Rx FIFO 1 message lost</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM</name>
              <description>High Priority Message</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No high priority message received</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>High priority message received</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC</name>
              <description>Transmission Completed</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No transmission completed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Transmission completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCF</name>
              <description>Transmission Cancellation Finished</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No transmission cancellation finished</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Transmission cancellation finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFE</name>
              <description>Tx FIFO Empty</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Tx FIFO non-empty</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Tx FIFO empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEFN</name>
              <description>Tx Event FIFO New Entry</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Tx Event FIFO unchanged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Tx Handler wrote Tx Event FIFO element</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEFW</name>
              <description>Tx Event FIFO Watermark Reached</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Tx Event FIFO fill level below watermark</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Tx Event FIFO fill level reached watermark</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEFF</name>
              <description>Tx Event FIFO Full</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Tx Event FIFO not full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Tx Event FIFO full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEFL</name>
              <description>Tx Event FIFO Element Lost</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No Tx Event FIFO element lost</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Tx Event FIFO element lost, also set after wr ite attempt to Tx Event FIFO of siz e zero</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSW</name>
              <description>Timestamp Wraparound</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No timestamp counter wrap-around</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Timestamp counter wrapped around</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRAF</name>
              <description>Message RAM Access Failure</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No Message RAM access failure occurred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Message RAM access failure occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOO</name>
              <description>Timeout Occurred</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No timeout</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Timeout reached</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRX</name>
              <description>Message stored to Dedicated Rx Buffer</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No Rx Buffer updated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>At least one received message stored into an Rx Buff er</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEC</name>
              <description>Bit Error Corrected</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No bit error detected when reading from Message RAM</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Bit error detected and corrected (e.g. ECC)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEU</name>
              <description>Bus Error Uncorrected</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No read slave error detected when reading from Message RAM</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Read slave error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELO</name>
              <description>Error Logging Overflow</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>CAN Error Logging Counter did not overflow</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Overflow of CAN Error Logging Counter occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP</name>
              <description>Error Passive</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Error_Passive status unchanged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Error_Passive status changed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EW</name>
              <description>Warning Status</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Error_Warning status unchanged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Error_Warning status changed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BO</name>
              <description>Bus_Off Status</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
