ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
        <register>
          <name>TRCVISSCTLR</name>
          <description>Use this to set, or read, the single address comparators that control the ViewInst start/stop
logic. The start/stop logic is active for an instruction which causes a start and remains active
up to and including an instruction which causes a stop, and then the start/stop logic becomes
inactive. Might ignore writes when the trace unit is enabled or not idle. If implemented then this register must be programmed.</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>START_0</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of starting trace.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 0, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 0, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_1</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of starting trace.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 1, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 1, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_2</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of starting trace.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 2, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 2, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_3</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of starting trace.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 3, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 3, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_4</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of starting trace.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 4, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 4, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_5</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of starting trace.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 5, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 5, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_6</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of starting trace.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 6, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 6, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_7</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of starting trace.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 7, is not selected as a start resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 7, is selected as a start resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_0</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 0, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 0, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_1</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 1, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 1, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_2</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 2, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 2, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_3</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 3, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 3, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_4</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 4, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 4, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_5</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 5, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 5, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_6</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 6, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 6, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_7</name>
              <description>Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The single address comparator 7, is not selected as a stop resource.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The single address comparator 7, is selected as a stop resource.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
