ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
          <register>
            <name>MISS</name>
            <description>The cache miss counter for cache region.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MISSES</name>
                <description>Number of cache misses</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LMISS</name>
            <description>The cache line miss counter for cache region.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LMISSES</name>
                <description>Number of cache line misses</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>READS</name>
            <description>Number of reads for cache region.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>READS</name>
                <description>Number of reads for cache region.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WRITES</name>
            <description>Number of writes for cache region.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WRITES</name>
                <description>Number of writes for cache region.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DEBUGLOCK</name>
          <description>Lock debug mode.</description>
          <addressOffset>0x430</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEBUGLOCK</name>
              <description>Lock debug mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Debug mode unlocked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Debug mode locked. Ignores any other value written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITELOCK</name>
          <description>Lock cache updates.</description>
          <addressOffset>0x434</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>WRITELOCK</name>
              <description>Lock cache updates</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Cache updates unlocked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Cache updates locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>VCACHEOWNER[%s]</name>
          <description>Description collection: Cache owners for the virtual cache regions.</description>
          <addressOffset>0x438</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION</name>
              <description>Owner [n] is mapped to this VCACHE region.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFETCHCONFIG</name>
          <description>Prefetch Policy.</description>
          <addressOffset>0x478</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Prefetch size</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>NEWLINE</name>
              <description>Allow speculative prefetch continue onto a new line.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Speculative prefetch continue onto a new line is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Speculative prefetch continue onto a new line is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE2</name>
              <description>Prefetch size 2</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>NEWLINE2</name>
              <description>Allow speculative prefetch continue onto a new line.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Speculative prefetch continue onto a new line is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Speculative prefetch continue onto a new line is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LINEADDRNS</name>
          <description>Same as register LINEADDR, but for non-secure access. The bit 28 of the address is hard coded to 0.</description>
          <addressOffset>0x47C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <!--Security securemapping=NS-->
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>COHERENCYSTATUS</name>
          <description>Unspecified</description>
          <headerStructName>CACHE_COHERENCYSTATUS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x480</addressOffset>
          <register>
            <name>INVALIDATELINE</name>
            <description>Performs an atomic read of the STATUS registers and triggering the Invalidate operation; accessible for non-secure access as well.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <readAction>modifyExternal</readAction>
            <size>0x20</size>
            <!--Security securemapping=NS-->
            <fields>
              <field>
                <name>BUSY</name>
                <description>Status</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>STATUS.READY was ready</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>STATUS.READY was busy</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CLEANLINE</name>
            <description>Performs an atomic read of the STATUS registers and triggering the Clean operation; accessible for non-secure access as well.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <readAction>modifyExternal</readAction>
            <size>0x20</size>
            <!--Security securemapping=NS-->
            <fields>
              <field>
                <name>BUSY</name>
                <description>Status</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>STATUS.READY was ready</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>STATUS.READY was busy</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLUSHLINE</name>
            <description>Performs an atomic read of the STATUS registers and triggering the Flush operation; accessible for non-secure access as well.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <readAction>modifyExternal</readAction>
            <size>0x20</size>
            <!--Security securemapping=NS-->
            <fields>
              <field>
                <name>BUSY</name>
                <description>Status</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>STATUS.READY was ready</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>STATUS.READY was busy</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
