ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
        <register>
          <name>REQSTATUS</name>
          <description>Request status</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RR0</name>
              <description>Request status for RR[0] register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[0] register is not enabled, or are already requesting reload</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[0] register is enabled, and are not yet requesting reload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR1</name>
              <description>Request status for RR[1] register</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[1] register is not enabled, or are already requesting reload</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[1] register is enabled, and are not yet requesting reload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR2</name>
              <description>Request status for RR[2] register</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[2] register is not enabled, or are already requesting reload</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[2] register is enabled, and are not yet requesting reload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR3</name>
              <description>Request status for RR[3] register</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[3] register is not enabled, or are already requesting reload</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[3] register is enabled, and are not yet requesting reload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR4</name>
              <description>Request status for RR[4] register</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[4] register is not enabled, or are already requesting reload</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[4] register is enabled, and are not yet requesting reload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR5</name>
              <description>Request status for RR[5] register</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[5] register is not enabled, or are already requesting reload</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[5] register is enabled, and are not yet requesting reload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR6</name>
              <description>Request status for RR[6] register</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[6] register is not enabled, or are already requesting reload</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[6] register is enabled, and are not yet requesting reload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR7</name>
              <description>Request status for RR[7] register</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DisabledOrRequested</name>
                  <description>RR[7] register is not enabled, or are already requesting reload</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAndUnrequested</name>
                  <description>RR[7] register is enabled, and are not yet requesting reload</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCNT</name>
          <description>Reload count</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RCNT</name>
              <description>Reload count, number of times the watchdog has been reloaded (kicked)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CRV</name>
          <description>Counter reload value</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CRV</name>
              <description>Counter reload value in number of cycles of the 32.768 kHz clock</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RREN</name>
          <description>Enable register for reload request registers</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RR0</name>
              <description>Enable or disable RR[0] register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable RR[0] register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable RR[0] register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR1</name>
              <description>Enable or disable RR[1] register</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable RR[1] register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable RR[1] register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR2</name>
              <description>Enable or disable RR[2] register</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable RR[2] register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable RR[2] register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR3</name>
              <description>Enable or disable RR[3] register</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable RR[3] register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable RR[3] register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR4</name>
              <description>Enable or disable RR[4] register</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable RR[4] register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable RR[4] register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR5</name>
              <description>Enable or disable RR[5] register</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable RR[5] register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable RR[5] register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR6</name>
              <description>Enable or disable RR[6] register</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable RR[6] register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable RR[6] register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR7</name>
              <description>Enable or disable RR[7] register</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable RR[7] register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable RR[7] register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLEEP</name>
              <description>Configure WDT to either be paused, or kept running, while the CPU is sleeping</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pause</name>
                  <description>Pause WDT while the CPU is sleeping</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Run</name>
                  <description>Keep WDT running while the CPU is sleeping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFF</name>
              <description>Enable or disable override of system OFF mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No impact on system OFF mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Prevent system OFF mode when WDT is running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Configure WDT to either be paused, or kept running, while the CPU is halted by the debugger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pause</name>
                  <description>Pause WDT while the CPU is halted by the debugger</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Run</name>
                  <description>Keep WDT running while the CPU is halted by the debugger</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Watchdog operation mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Watchdog</name>
                  <description>Use WDT as a watchdog</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer</name>
                  <description>Use WDT a timer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RELOAD</name>
              <description>Enable or disable possibility to reload CRV between TIMEOUT and watchdog reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPEN</name>
              <description>Allow stopping WDT</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Do not allow stopping WDT</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Allow stopping WDT</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RRKEY</name>
          <description>Reload request key</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <resetValue>0x6E524635</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RRKEY</name>
              <description>Reload request key</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TSKEY</name>
          <description>Task stop key</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <resetValue>0x6E524635</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSKEY</name>
              <description>Task stop key</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TSEN</name>
          <description>Task stop enable</description>
          <addressOffset>0x520</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSEN</name>
              <description>Allow stopping WDT</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Value to allow stopping WDT</description>
                  <value>0x6E524635</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RR[%s]</name>
          <description>Description collection: Reload request n</description>
          <addressOffset>0x600</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RR</name>
              <description>Reload request register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Reload</name>
                  <description>Value to request a reload of the watchdog timer</description>
                  <value>0x6E524635</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
