ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
          <register>
            <name>INTMSKCRCFRAMEFATAL</name>
            <description>Interrupt mask for INT_ST_CRC_FRAME_FATAL controls which interrupt status bits trigger the interrupt pin. Bit at 1 - Enable the interrupt source. Bit at 0 - Interrupt source is masked.</description>
            <addressOffset>0x2A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFRAMEDATAVC0</name>
                <description>Mask for err_frame_data_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC1</name>
                <description>Mask for err_frame_data_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC2</name>
                <description>Mask for err_frame_data_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC3</name>
                <description>Mask for err_frame_data_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC4</name>
                <description>Mask for err_frame_data_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC5</name>
                <description>Mask for err_frame_data_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC6</name>
                <description>Mask for err_frame_data_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC7</name>
                <description>Mask for err_frame_data_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC8</name>
                <description>Mask for err_frame_data_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC9</name>
                <description>Mask for err_frame_data_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC10</name>
                <description>Mask for err_frame_data_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC11</name>
                <description>Mask for err_frame_data_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC12</name>
                <description>Mask for err_frame_data_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC13</name>
                <description>Mask for err_frame_data_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC14</name>
                <description>Mask for err_frame_data_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC15</name>
                <description>Mask for err_frame_data_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFORCECRCFRAMEFATAL</name>
            <description>Interrupt force register is used for test purposes, and allows triggering INT_ST_CRC_FRAME_FATAL interrupt events individually. There is no need to activate the conditions that trigger the interrupt sources, because it may be extremely complex to generate stimuli for that purpose. This register is auto-clear.</description>
            <addressOffset>0x2A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFRAMEDATAVC0</name>
                <description>Force err_frame_data_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC1</name>
                <description>Force err_frame_data_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC2</name>
                <description>Force err_frame_data_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC3</name>
                <description>Force err_frame_data_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC4</name>
                <description>Force err_frame_data_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC5</name>
                <description>Force err_frame_data_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC6</name>
                <description>Force err_frame_data_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC7</name>
                <description>Force err_frame_data_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC8</name>
                <description>Force err_frame_data_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC9</name>
                <description>Force err_frame_data_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC10</name>
                <description>Force err_frame_data_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC11</name>
                <description>Force err_frame_data_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC12</name>
                <description>Force err_frame_data_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC13</name>
                <description>Force err_frame_data_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC14</name>
                <description>Force err_frame_data_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRFRAMEDATAVC15</name>
                <description>Force err_frame_data_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTPLDCRCFATAL</name>
            <description>Fatal interruption related with Payload Checksum error.</description>
            <addressOffset>0x2B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRCRCVC0</name>
                <description>Payload Checksum error detected on virtual channel 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC1</name>
                <description>Payload Checksum error detected on virtual channel 1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC2</name>
                <description>Payload Checksum error detected on virtual channel 2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC3</name>
                <description>Payload Checksum error detected on virtual channel 3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC4</name>
                <description>Payload Checksum error detected on virtual channel 4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC5</name>
                <description>Payload Checksum error detected on virtual channel 5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC6</name>
                <description>Payload Checksum error detected on virtual channel 6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC7</name>
                <description>Payload Checksum error detected on virtual channel 7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC8</name>
                <description>Payload Checksum error detected on virtual channel 8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC9</name>
                <description>Payload Checksum error detected on virtual channel 9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC10</name>
                <description>Payload Checksum error detected on virtual channel 10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC11</name>
                <description>Payload Checksum error detected on virtual channel 11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC12</name>
                <description>Payload Checksum error detected on virtual channel 12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC13</name>
                <description>Payload Checksum error detected on virtual channel 13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC14</name>
                <description>Payload Checksum error detected on virtual channel 14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRCRCVC15</name>
                <description>Payload Checksum error detected on virtual channel 15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTMSKPLDCRCFATAL</name>
            <description>Interrupt mask for INT_ST_PLD_CRC_FATAL controls which interrupt status bits trigger the interrupt pin. Bit at 1 - Enable the interrupt source. Bit at 0 - Interrupt source is masked.</description>
            <addressOffset>0x2B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRCRCVC0</name>
                <description>Mask for err_crc_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRCRCVC1</name>
                <description>Mask for err_crc_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRCRCVC2</name>
                <description>Mask for err_crc_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRCRCVC3</name>
                <description>Mask for err_crc_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRCRCVC4</name>
                <description>Mask for err_crc_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRCRCVC5</name>
                <description>Mask for err_crc_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRCRCVC6</name>
                <description>Mask for err_crc_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRCRCVC7</name>
                <description>Mask for err_crc_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRCRCVC8</name>
                <description>Mask for err_crc_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRCRCVC9</name>
                <description>Mask for err_crc_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRCRCVC10</name>
                <description>Mask for err_crc_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRCRCVC11</name>
                <description>Mask for err_crc_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRCRCVC12</name>
                <description>Mask for err_crc_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRCRCVC13</name>
                <description>Mask for err_crc_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRCRCVC14</name>
                <description>Mask for err_crc_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRCRCVC15</name>
                <description>Mask for err_crc_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFORCEPLDCRCFATAL</name>
            <description>Interrupt force register is used for test purposes, and allows triggering INT_ST_PLD_CRC_FATAL interrupt events individually. There is no need to activate the conditions that trigger the interrupt sources, because it may be extremely complex to generate stimuli for that purpose. This register is auto-clear.</description>
            <addressOffset>0x2B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRCRCVC0</name>
                <description>Force err_crc_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRCRCVC1</name>
                <description>Force err_crc_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRCRCVC2</name>
                <description>Force err_crc_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRCRCVC3</name>
                <description>Force err_crc_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRCRCVC4</name>
                <description>Force err_crc_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRCRCVC5</name>
                <description>Force err_crc_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRCRCVC6</name>
                <description>Force err_crc_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRCRCVC7</name>
                <description>Force err_crc_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRCRCVC8</name>
                <description>Force err_crc_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRCRCVC9</name>
                <description>Force err_crc_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRCRCVC10</name>
                <description>Force err_crc_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRCRCVC11</name>
                <description>Force err_crc_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRCRCVC12</name>
                <description>Force err_crc_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRCRCVC13</name>
                <description>Force err_crc_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRCRCVC14</name>
                <description>Force err_crc_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRCRCVC15</name>
                <description>Force err_crc_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
