ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
          <register>
            <name>GPUCMDSTATUS</name>
            <description>On read, returns internal CL processor status.</description>
            <addressOffset>0x0E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDFSMFETCH</name>
                <description>Indicates the state of the FSM responsible for fetching</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>POS01LEN03</name>
                <lsb>1</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>CMDFSM</name>
                <description>Indicates the state of CMDList internal FSM.</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>POS07LEN02</name>
                <lsb>7</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>STKPNTADDR</name>
                <description>Show the address of the stack pointer</description>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>POS12LEN01</name>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>FIFOAVAIL</name>
                <description>Show how many cells are still available in FIFO</description>
                <lsb>13</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>POS25LEN03</name>
                <lsb>25</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>CMDMEMBUSY</name>
                <description>Indicates if the Command List Processor System Memory is busy</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>FIFOREADDATA</name>
                <description>Indicates if there are available data to read from FIFO</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>SYSMEMDATA</name>
                <description>Indicates if there are data available in System Memory</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>BUSYCMD</name>
                <description>Indicates if the Command List Processor is busy</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCMDRINGSTOP</name>
            <description>Ring Buffer's pointer.</description>
            <addressOffset>0x0EC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDRINGSTOP</name>
                <description>Stores the Ring Buffer's last written address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCMDADDR</name>
            <description>Command list base address.</description>
            <addressOffset>0x0F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDADDR</name>
                <description>Specifies the base address of every new command list ready to be executed</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCMDSIZE</name>
            <description>Command list length in words(32-bits)</description>
            <addressOffset>0x0F4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDSIZE</name>
                <description>Specifies the length of the command list ready to be executed.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUINTERRUPT</name>
            <description>Interrupt control register</description>
            <addressOffset>0x0F8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POLARITY</name>
                <description>1: IRQ signal is active low</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>CL</name>
                <description>When set to 1, signals an interrupt at the end of a command list</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>DRAW</name>
                <description>When set to 1, signals an interrupt at the end of a drawing command</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>CLEAR</name>
                <description>When set to 1, the interrupt in the NEMA_IRQ_ID register is cleared</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>GPUINTERRUPTPOS04LEN26</name>
                <lsb>4</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>THROTTLE</name>
                <description>When set to 1, the throttle signal will be ignored.</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>GPUINTERRUPTPOS28LEN02</name>
                <lsb>28</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>CLKDVFS</name>
                <description>Specify the core_clk_dvfs output</description>
                <lsb>30</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUSTATUS</name>
            <description>On read, returns Nema's status.</description>
            <addressOffset>0x0FC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>C0</name>
                <description>Indicates if the Core 0 is busy</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>C1</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>C2</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>C3</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PIPEC0</name>
                <description>Indicates if the Core 0 graphics pipeline is busy</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PIPEC1</name>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>PIPEC2</name>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>PIPEC3</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TEXC0</name>
                <description>Indicates if the Core 0 Texture Map Unit is busy</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TEXC1</name>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>TEXC2</name>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>TEXC3</name>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ROPC0</name>
                <description>Indicates if the Core 0 Render Output Unit is busy</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ROPC1</name>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ROPC2</name>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ROPC3</name>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GPUSTATUSPOS16LEN02</name>
                <lsb>16</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>RASTERIZERVG</name>
                <description>Indicates if the Rasterizer Vertex Matrix Multiplication Unit and Tesselation Unit are busy</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>GPUSTATUSPOS20LEN04</name>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>RASTERIZER</name>
                <description>Indicate if the Rasterizer Unit is busy</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>CL</name>
                <description>Indicates if the Command List Processor is  busy</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>CLBUS</name>
                <description>Indicates if the Command List bus is busy</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>BUSIF</name>
                <description>Indicates if the Bus Interface Unit is busy</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>SYSTEM</name>
                <description>Indicates if the system is busy</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWCMDNOHOLD</name>
            <description>Rasterizer Command (e.g. draw triangle, rectangle etc)</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DRAWCMD</name>
                <description>Draw Command</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>GPUDRAWCMDNOHOLDPOS04LEN19</name>
                <lsb>4</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>AAEDGE3</name>
                <description>When set to 1, Antialiasing feature is enabled for edge 3</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>AAEDGE2</name>
                <description>When set to 1, Antialiasing feature is enabled for edge 2</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>AAEDGE1</name>
                <description>When set to 1, Antialiasing feature is enabled for edge 1</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>AAEDGE0</name>
                <description>When set to 1, Antialiasing feature is enabled for edge 0</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>DRAWGRADIENT</name>
                <description>When set to 1, color gradient is enabled</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>DRAWNEGCULLING</name>
                <description>When set to 1, negative culling (clockwise) is enabled</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>DRAWPOSCULLING</name>
                <description>When set to 1, positive culling (counter-clockwise) is enabled</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>DRAWTILE</name>
                <description>When set to 1, tile mode is enabled</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>DRAWTILESIZE</name>
                <description>When set to 1, tile size is 2x2</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWSTARTXY</name>
            <description>Vertex 0 drawing primitive. This register is used only for integer values. For greater accuracy</description>
            <addressOffset>0x104</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTX</name>
                <description>Specifies the X coordinate (integer value) of vertex 0</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>STARTY</name>
                <description>Specifies the Y coordinate (integer value) of vertex 0</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWENDXY</name>
            <description>Vertex 1 drawing primitive. This register is used only for integer values. For greater accuracy</description>
            <addressOffset>0x108</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENDX</name>
                <description>Specifies the X coordinate (integer value) of vertex 1</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>ENDY</name>
                <description>Specifies the Y coordinate (integer value) of vertex 1</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWFANX</name>
            <description>X coordinate of the Fan center point. Its content should be considered volatile.</description>
            <addressOffset>0x10C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of bezier vertex 4 drawing primitive (fixed point 16.16 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCLIPMIN</name>
            <description>Clipping Rectangle upper left vertex</description>
            <addressOffset>0x110</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLIPMINX</name>
                <description>Define the upper left X coordinate</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CLIPMINY</name>
                <description>Define the upper left Y coordinate</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCLIPMAX</name>
            <description>Clipping Rectangle bottom right vertex</description>
            <addressOffset>0x114</addressOffset>
            <access>read-write</access>
            <resetValue>0x7FFF7FFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLIPMAXX</name>
                <description>Define the bottom left X coordinate</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CLIPMAXY</name>
                <description>Define the bottom left Y coordinate</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUMATMULT</name>
            <description>Rasterizer matrix multiplication control. This register is partially updated</description>
            <addressOffset>0x118</addressOffset>
            <access>read-write</access>
            <resetValue>0x05000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUMATMULTPOS00LEN24</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>BYPASSVMM</name>
                <description>When set to 1, the vertex matrix multiplications are bypassed</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>GPUMATMULTPOS25LEN01</name>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>GPUMATMULTPOS26LEN02</name>
                <lsb>26</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BYPASSMM</name>
                <description>When set to 1, the matrix multiplications are bypassed</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>ADDHALF</name>
                <description>When set to 1, the 0.5 value is added to the X and Y coordinates</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>GPUMATMULTPOS30LEN02</name>
                <lsb>30</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCODEPTR</name>
            <description>Shader code pointer</description>
            <addressOffset>0x11C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FRG</name>
                <description>Specifies the pointer for the instruction that will be executed for the foreground pixels</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BCG</name>
                <description>Specifies the pointer for the instruction that will be executed for the background pixels</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWPT0X</name>
            <description>X coordinate of vertex 0 drawing primitive. The value is 16.16 fixed point.</description>
            <addressOffset>0x120</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of vertex 0 drawing primitive (16.16 fixed point)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWPT0Y</name>
            <description>Y coordinate of vertex 0 drawing primitive. The value is 16.16 fixed point.</description>
            <addressOffset>0x124</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the Y coordinate of vertex 0 drawing primitive (16.16 fixed point)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWFANY</name>
            <description>Y coordinate of the Fan center point. Its content should be considered volatile.</description>
            <addressOffset>0x128</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the X coordinate of bezier vertex 4 drawing primitive (fixed point 16.16 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUDRAWCOLOR</name>
            <description>Rasterizer drawing color for filling primitives</description>
            <addressOffset>0x12C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DRAWCOLOR</name>
                <description>Specifies the drawing color for filling primitives</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
