ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
        <register>
          <name>READYNEXTTIMEOUT</name>
          <description>Preload timeout value for waiting for a next write</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Preload value</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>DW</name>
              <description>Triggers a write to MRAMC macro on the ready next timeout in direct write mode
                  (CONFIG.WEN = 2) and 
                  some data written into the internal write buffer.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>No write trigger</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Write trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>LOWAVGCURR</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_MRAMC_LOWAVGCURR</headerStructName>
          <access>read-write</access>
          <addressOffset>0x510</addressOffset>
          <register>
            <name>READ</name>
            <description>Preload timeout value for low average current in case of read</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Preload value</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WRITE</name>
            <description>Preload timeout value for low average current in case of write</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Preload value</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ERASE</name>
            <description>Preload timeout value for low average current in case of erase</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Preload value</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>POWER</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_MRAMC_POWER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x520</addressOffset>
          <register>
            <name>INIT</name>
            <description>Initiates power up or down sequence.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE</name>
                <description>Power mode.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No change in power mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerUp</name>
                    <description>Triggers power up sequence. Ignored if MRAM is already in Active mode or Standby mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerDown</name>
                    <description>Initiates power down sequence. Ignored if MRAM is already in MRAM_OFF mode.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerDownTrimRet</name>
                    <description>Initiates power down sequence with trim retained. Ignored if MRAM is already in MRAM_OFF_TRIM_RETAIN mode.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY</name>
                <description>Key to enable the writing to this register.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable the writing to this register</description>
                    <value>0x0000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable the writing to this register</description>
                    <value>0xA66D</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOPOWERDOWN</name>
            <description>Configures the automatic power down feature using the inactive time period of MRAM.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMEOUTVALUE</name>
                <description>Timeout value for the power down.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>POWERDOWNCFG</name>
                <description>Power down mode when the timeout happens.</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MramOffTrimRetain</name>
                    <description>Power mode is MRAM_OFF_TRIM_RETAIN</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MramOff</name>
                    <description>Power mode is MRAM_OFF</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable the automatic power down feature.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable the automatic power down feature</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable the automatic power down feature</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MASK</name>
            <description>Mask for the various voltages supplies when initiating power up/down.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VDD</name>
                <description>Mask VDD</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Mask</name>
                    <description>Mask VDD</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDA</name>
                <description>Mask VDDA</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Mask</name>
                    <description>Mask VDDA</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDCFG</name>
                <description>Mask VDD_CFG</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Mask</name>
                    <description>Mask VDD_CFG</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VREFVPR</name>
                <description>Mask VREF and VPR</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Mask</name>
                    <description>Mask VREF and VPR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY</name>
                <description>Key to enable the writing to this register.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable the writing to this register</description>
                    <value>0x0000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable the writing to this register</description>
                    <value>0xA66D</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status of the power up/down sequence.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STATE</name>
                <description>The current power up/down state.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>MRAM is OFF</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerUpSeq</name>
                    <description>MRAM power up sequence is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TrimConfigSeq</name>
                    <description>Request for the MRAM trim configuration.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TrimConfigWait</name>
                    <description>Waiting for the MRAM trim configuration to complete.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TrimConfigDone</name>
                    <description>The MRAM trim configuration to completed (This is momentary state).</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Standby</name>
                    <description>MRAM is in standby mode.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Active</name>
                    <description>MRAM is in active mode (or in standby mode)</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PowerDownSeq</name>
                    <description>MRAM power down sequence is active</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OffTrimRetain</name>
                    <description>MRAM is OFF with trim configuration in retain</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERUPACK</name>
            <description>Status of the power control signals acknowledgement during power up sequence.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VREFVPR</name>
                <description>Waiting for VREF and VPR up ACK or not</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>Busy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDD</name>
                <description>Waiting for VDD up ACK or not</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>Busy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDCFG</name>
                <description>Waiting for VDD_CFG up ACK or not</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>Busy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDA</name>
                <description>Waiting for VDDA up ACK or not</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>Busy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>POWERDOWNACK</name>
            <description>Status of the power control signals acknowledgement during power down sequence.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VREFVPR</name>
                <description>Waiting for VREF and VPR down ACK or not</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>Busy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDD</name>
                <description>Waiting for VDD down ACK or not</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>Busy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDCFG</name>
                <description>Waiting for VDD_CFG down ACK or not</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>Busy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDA</name>
                <description>Waiting for VDDA down ACK or not</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>Busy</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Ready</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
