ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
            <register>
              <name>IMR</name>
              <description>Interrupt Mask Register</description>
              <addressOffset>0x02C</addressOffset>
              <access>read-write</access>
              <resetValue>0x0000043F</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXEIM</name>
                  <description>Transmit FIFO Empty Interrupt Mask</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_txe_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_txe_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXOIM</name>
                  <description>Transmit FIFO Overflow Interrupt Mask</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_txo_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_txo_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXUIM</name>
                  <description>Receive FIFO Underflow Interrupt Mask</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_rxu_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_rxu_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXOIM</name>
                  <description>Receive FIFO Overflow Interrupt Mask</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_rxo_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_rxo_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXFIM</name>
                  <description>Receive FIFO Full Interrupt Mask</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_rxf_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_rxf_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MSTIM</name>
                  <description>Multi-Controller Contention Interrupt Mask. This bit field is not present if the QSPI CORE is configured as a serial-controller device.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_mst_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_mst_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>XRXOIM</name>
                  <description>XIP Receive FIFO Overflow Interrupt Mask</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_xrxo_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_xrxo_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXUIM</name>
                  <description>Transmit FIFO Underflow Interrupt Mask</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_txu_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_txu_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>AXIEM</name>
                  <description>AXI Error Interrupt Mask</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_axie_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_axie_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD9IMR</name>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPITEM</name>
                  <description>SPI Transmit Error Interrupt Mask</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_spite_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_spite_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DONEM</name>
                  <description>SSI Done Interrupt Mask</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_done_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_done_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD1231IMR</name>
                  <lsb>12</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>ISR</name>
              <description>Interrupt Status Register</description>
              <addressOffset>0x030</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXEIS</name>
                  <description>Transmit FIFO Empty Interrupt Status</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txe_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txe_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXOIS</name>
                  <description>Transmit FIFO Overflow Interrupt Status</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txo_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txo_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXUIS</name>
                  <description>Receive FIFO Underflow Interrupt Status</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxu_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxu_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXOIS</name>
                  <description>Receive FIFO Overflow Interrupt Status</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxo_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxo_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXFIS</name>
                  <description>Receive FIFO Full Interrupt Status</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxf_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxf_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MSTIS</name>
                  <description>Multi-Controller Contention Interrupt Status. This bit field is not present</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_mst_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_mst_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>XRXOIS</name>
                  <description>XIP Receive FIFO Overflow Interrupt Status</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_xrxo_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_xrxo_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXUIS</name>
                  <description>Transmit FIFO Underflow Interrupt Status</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txu_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txu_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>AXIES</name>
                  <description>AXI Error Interrupt Status</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_axie_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_axie_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD9RISR</name>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPITES</name>
                  <description>SPI Transmit Error Interrupt</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_spite_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_spite_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DONES</name>
                  <description>SSI Done Interrupt Status</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_done_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_done_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD1231RISR</name>
                  <lsb>12</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
