ankuns/nrfx/bsp/stable/mdk/nrf7140_application.svd
    <peripheral derivedFrom="GLOBAL_PDM130_NS">
      <name>GLOBAL_PDM132_NS</name>
      <description>Pulse Density Modulation (Digital Microphone) Interface 4</description>
      <baseAddress>0x4F9C7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PDM132</name>
        <value>455</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PDM130_NS">
      <name>GLOBAL_PDM132_S</name>
      <description>Pulse Density Modulation (Digital Microphone) Interface 5</description>
      <baseAddress>0x5F9C7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PDM132</name>
        <value>455</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC136_NS</name>
      <description>Distributed programmable peripheral interconnect controller 14</description>
      <baseAddress>0x4F9D1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC136_S</name>
      <description>Distributed programmable peripheral interconnect controller 15</description>
      <baseAddress>0x5F9D1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER136_NS</name>
      <description>Timer/Counter 16</description>
      <baseAddress>0x4F9D2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER136</name>
        <value>466</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER136_S</name>
      <description>Timer/Counter 17</description>
      <baseAddress>0x5F9D2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER136</name>
        <value>466</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER137_NS</name>
      <description>Timer/Counter 18</description>
      <baseAddress>0x4F9D3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER137</name>
        <value>467</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER137_S</name>
      <description>Timer/Counter 19</description>
      <baseAddress>0x5F9D3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER137</name>
        <value>467</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM133_NS</name>
      <description>Pulse width modulation unit 8</description>
      <baseAddress>0x4F9D4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM133</name>
        <value>468</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM133_S</name>
      <description>Pulse width modulation unit 9</description>
      <baseAddress>0x5F9D4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM133</name>
        <value>468</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM136_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 20</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS136_NS</name>
      <description>SPI Slave 14</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM136_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 12</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS136_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 12</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE136_NS</name>
      <description>UART with EasyDMA 14</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM136_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 21</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS136_S</name>
      <description>SPI Slave 15</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM136_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 13</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS136_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 13</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE136_S</name>
      <description>UART with EasyDMA 15</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM137_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 22</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS137_NS</name>
      <description>SPI Slave 16</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM137_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 14</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS137_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 14</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE137_NS</name>
      <description>UART with EasyDMA 16</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM137_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 23</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS137_S</name>
      <description>SPI Slave 17</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM137_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 15</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS137_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 15</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE137_S</name>
      <description>UART with EasyDMA 17</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PDM130_NS">
      <name>GLOBAL_PDM133_NS</name>
      <description>Pulse Density Modulation (Digital Microphone) Interface 6</description>
      <baseAddress>0x4F9D7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PDM133</name>
        <value>471</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PDM130_NS">
      <name>GLOBAL_PDM133_S</name>
      <description>Pulse Density Modulation (Digital Microphone) Interface 7</description>
      <baseAddress>0x5F9D7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PDM133</name>
        <value>471</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>